Tekla Open API Reference for Tekla Structures 2025
PluginWindowBase.Get Method
 Gets the dialog values from the part that is currently selected in Tekla Structures.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Get()
Public Sub Get
See Also
Reference
PluginWindowBase Class
Tekla.Structures.Dialog Namespace